// Автоматичне приховування банера з підказкою

import { refs } from './js/refs';

// Контекст:
// На сторінці після завантаження з’являється підказка для користувача. Через кілька секунд її потрібно автоматично прибрати.

// Базовий HTML:

// <section class="task hint-task">
//   <aside class="hint-banner">
//     <p class="hint-text">Не забудьте перевірити введені дані перед надсиланням.</p>
//   </aside>
// </section>

// Розширене ТЗ:
// · Після завантаження сторінки потрібно запустити setTimeout на 3000 мс.
// · Через 3000 мс елемент .hint-banner потрібно приховати.
// · id таймера потрібно зберегти в окремій змінній.
// · До завершення таймера банер має залишатися видимим.
// · Логіка повинна працювати без додаткових дій користувача

const Timer = setTimeout(() => {
  refs.hintBanner.classList.add('hidden');
}, 3000);
// const Timer = setInterval(() => {
//   refs.hintBanner.classList.toggle('hidden');
// }, 1000);
